export const AZKAR_DATA = {

  morning: [
    "أصبحنا وأصبح الملك لله والحمد لله",
    "اللهم بك أصبحنا وبك أمسينا وبك نحيا وبك نموت",
    "رضيت بالله رباً وبالإسلام ديناً وبمحمد ﷺ نبياً",
    "اللهم ما أصبح بي من نعمة أو بأحد من خلقك فمنك وحدك",
    "حسبي الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم (7 مرات)",
    "بسم الله الذي لا يضر مع اسمه شيء (3 مرات)",
    "اللهم عافني في بدني اللهم عافني في سمعي",
    "أعوذ بكلمات الله التامات من شر ما خلق",
    "سبحان الله وبحمده (100 مرة)",
  ],

  evening: [
    "أمسينا وأمسى الملك لله والحمد لله",
    "اللهم بك أمسينا وبك أصبحنا وبك نحيا وبك نموت",
    "اللهم إني أعوذ بك من الكفر والفقر",
    "بسم الله الذي لا يضر مع اسمه شيء (3 مرات)",
    "أعوذ بكلمات الله التامات من شر ما خلق",
    "رضيت بالله رباً وبالإسلام ديناً وبمحمد ﷺ نبياً",
  ],

  sleep: [
    "باسمك اللهم أموت وأحيا",
    "اللهم قني عذابك يوم تبعث عبادك",
    "سبحان الله (33) الحمد لله (33) الله أكبر (34)",
    "اللهم أسلمت نفسي إليك وفوضت أمري إليك",
    "آية الكرسي",
    "آخر آيتين من سورة البقرة",
  ],

  afterPrayer: [
    "أستغفر الله (3)",
    "اللهم أنت السلام ومنك السلام",
    "سبحان الله (33) الحمد لله (33) الله أكبر (33)",
    "لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير",
    "اللهم أعني على ذكرك وشكرك وحسن عبادتك",
  ],

  wudu: [
    "أشهد أن لا إله إلا الله وحده لا شريك له وأشهد أن محمداً عبده ورسوله",
    "اللهم اجعلني من التوابين واجعلني من المتطهرين",
  ],

  mosque: [
    "اللهم افتح لي أبواب رحمتك",
    "اللهم إني أسألك من فضلك",
  ],

  food: [
    "بسم الله",
    "الحمد لله الذي أطعمنا وسقانا",
  ],

  general: [
    "لا حول ولا قوة إلا بالله",
    "سبحان الله العظيم وبحمده",
    "اللهم صل وسلم على نبينا محمد",
    "أستغفر الله العظيم وأتوب إليه",
  ],
};





export const AZKAR = {
  morning:[
    {
      text:"أصبحنا وأصبح الملك لله والحمد لله لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير...",
      count:1
    },
    {
      text:"اللهم بك أصبحنا وبك أمسينا وبك نحيا وبك نموت وإليك النشور",
      count:1
    },
    {
      text:"رضيت بالله رباً وبالإسلام ديناً وبمحمد ﷺ نبياً",
      count:3
    },
    {
      text:"بسم الله الذي لا يضر مع اسمه شيء في الأرض ولا في السماء وهو السميع العليم",
      count:3
    },
    {
      text:"أعوذ بكلمات الله التامات من شر ما خلق",
      count:3
    }
  ],

  evening:[
    {
      text:"أمسينا وأمسى الملك لله والحمد لله لا إله إلا الله وحده لا شريك له...",
      count:1
    },
    {
      text:"اللهم ما أمسى بي من نعمة فمنك وحدك لا شريك لك فلك الحمد ولك الشكر",
      count:1
    }
  ],

  sleep:[
    {
      text:"باسمك اللهم أموت وأحيا",
      count:1
    },
    {
      text:"اللهم قني عذابك يوم تبعث عبادك",
      count:3
    }
  ],

  afterPrayer:[
    {
      text:"سبحان الله",
      count:33
    },
    {
      text:"الحمد لله",
      count:33
    },
    {
      text:"الله أكبر",
      count:34
    }
  ]
};
